MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120F8TA/mcu.h
/*******************************************************************************
                Bit definition for Peripheral ICG
*******************************************************************************/
/*  Bit definition for ICG_ICG0 register  */
#define ICG_ICG0_SWDTAUTS_POS                          (0U)
#define ICG_ICG0_SWDTAUTS                              (0x00000001UL)
#define ICG_ICG0_SWDTITS_POS                           (1U)
#define ICG_ICG0_SWDTITS                               (0x00000002UL)
#define ICG_ICG0_SWDTPERI_POS                          (2U)
#define ICG_ICG0_SWDTPERI                              (0x0000000CUL)
#define ICG_ICG0_SWDTPERI_0                            (0x00000004UL)
#define ICG_ICG0_SWDTPERI_1                            (0x00000008UL)
#define ICG_ICG0_SWDTCKS_POS                           (4U)
#define ICG_ICG0_SWDTCKS                               (0x000000F0UL)
#define ICG_ICG0_SWDTCKS_0                             (0x00000010UL)
#define ICG_ICG0_SWDTCKS_1                             (0x00000020UL)
#define ICG_ICG0_SWDTCKS_2                             (0x00000040UL)
#define ICG_ICG0_SWDTCKS_3                             (0x00000080UL)
#define ICG_ICG0_SWDTWDPT_POS                          (8U)
#define ICG_ICG0_SWDTWDPT                              (0x00000F00UL)
#define ICG_ICG0_SWDTWDPT_0                            (0x00000100UL)
#define ICG_ICG0_SWDTWDPT_1                            (0x00000200UL)
#define ICG_ICG0_SWDTWDPT_2                            (0x00000400UL)
#define ICG_ICG0_SWDTWDPT_3                            (0x00000800UL)
#define ICG_ICG0_SWDTSLPOFF_POS                        (12U)
#define ICG_ICG0_SWDTSLPOFF                            (0x00001000UL)
#define ICG_ICG0_HRCREQS_POS                           (16U)
#define ICG_ICG0_HRCREQS                               (0x000F0000UL)
#define ICG_ICG0_HRCREQS_0                             (0x00010000UL)
#define ICG_ICG0_HRCREQS_1                             (0x00020000UL)
#define ICG_ICG0_HRCREQS_2                             (0x00040000UL)
#define ICG_ICG0_HRCREQS_3                             (0x00080000UL)
#define ICG_ICG0_NMIFCLK_POS                           (26U)
#define ICG_ICG0_NMIFCLK                               (0x0C000000UL)
#define ICG_ICG0_NMIFCLK_0                             (0x04000000UL)
#define ICG_ICG0_NMIFCLK_1                             (0x08000000UL)
#define ICG_ICG0_NMIFEN_POS                            (28U)
#define ICG_ICG0_NMIFEN                                (0x10000000UL)
#define ICG_ICG0_NMITRG_POS                            (29U)
#define ICG_ICG0_NMITRG                                (0x20000000UL)
#define ICG_ICG0_NMIEN_POS                             (30U)
#define ICG_ICG0_NMIEN                                 (0x40000000UL)
#define ICG_ICG0_NMIICGEN_POS                          (31U)
#define ICG_ICG0_NMIICGEN                              (0x80000000UL)

/*  Bit definition for ICG_ICG1 register  */
#define ICG_ICG1_DFS_POS                               (0U)
#define ICG_ICG1_DFS                                   (0x00000003UL)
#define ICG_ICG1_DFS_0                                 (0x00000001UL)
#define ICG_ICG1_DFS_1                                 (0x00000002UL)
#define ICG_ICG1_DFDIS_POS                             (2U)
#define ICG_ICG1_DFDIS                                 (0x00000004UL)
#define ICG_ICG1_LVDLVL_POS                            (8U)
#define ICG_ICG1_LVDLVL                                (0x00000F00UL)
#define ICG_ICG1_LVDLVL_0                              (0x00000100UL)
#define ICG_ICG1_LVDLVL_1                              (0x00000200UL)
#define ICG_ICG1_LVDLVL_2                              (0x00000400UL)
#define ICG_ICG1_LVDLVL_3                              (0x00000800UL)
#define ICG_ICG1_NMIS_POS                              (12U)
#define ICG_ICG1_NMIS                                  (0x00001000UL)
#define ICG_ICG1_IRS_POS                               (13U)
#define ICG_ICG1_IRS                                   (0x00002000UL)
#define ICG_ICG1_IRDIS_POS                             (14U)
#define ICG_ICG1_IRDIS                                 (0x00004000UL)
#define ICG_ICG1_LVDDIS_POS                            (15U)
#define ICG_ICG1_LVDDIS                                (0x00008000UL)

/*  Bit definition for ICG_ICG2 register  */
#define ICG_ICG2                                       (0xFFFFFFFFUL)

/*  Bit definition for ICG_ICG3 register  */
#define ICG_ICG3                                       (0xFFFFFFFFUL)

/*  Bit definition for ICG_ICG4 register  */
#define ICG_ICG4                                       (0xFFFFFFFFUL)

/*  Bit definition for ICG_ICG5 register  */
#define ICG_ICG5                                       (0xFFFFFFFFUL)

/*  Bit definition for ICG_ICG6 register  */
#define ICG_ICG6                                       (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral INTC
*******************************************************************************/
/*  Bit definition for INTC_NMICR register  */
#define INTC_NMICR_NMITRG_POS                          (0U)
#define INTC_NMICR_NMITRG                              (0x00000001UL)
#define INTC_NMICR_NMIFCLK_POS                         (4U)
#define INTC_NMICR_NMIFCLK                             (0x00000030UL)
#define INTC_NMICR_NMIFCLK_0                           (0x00000010UL)
#define INTC_NMICR_NMIFCLK_1                           (0x00000020UL)
#define INTC_NMICR_NMIFEN_POS                          (7U)
#define INTC_NMICR_NMIFEN                              (0x00000080UL)

/*  Bit definition for INTC_NMIENR register  */
#define INTC_NMIENR_NMIEN_POS                          (0U)
#define INTC_NMIENR_NMIEN                              (0x00000001UL)
#define INTC_NMIENR_XTALSTPEN_POS                      (1U)
#define INTC_NMIENR_XTALSTPEN                          (0x00000002UL)
#define INTC_NMIENR_SWDTEN_POS                         (2U)
#define INTC_NMIENR_SWDTEN                             (0x00000004UL)
#define INTC_NMIENR_PVDEN_POS                          (3U)
#define INTC_NMIENR_PVDEN                              (0x00000008UL)

/*  Bit definition for INTC_NMIFR register  */
#define INTC_NMIFR_NMIF_POS                            (0U)
#define INTC_NMIFR_NMIF                                (0x00000001UL)
#define INTC_NMIFR_XTALSTPF_POS                        (1U)
#define INTC_NMIFR_XTALSTPF                            (0x00000002UL)
#define INTC_NMIFR_SWDTF_POS                           (2U)
#define INTC_NMIFR_SWDTF                               (0x00000004UL)
#define INTC_NMIFR_PVDF_POS                            (3U)
#define INTC_NMIFR_PVDF                                (0x00000008UL)

/*  Bit definition for INTC_NMICLR register  */
#define INTC_NMICLR_NMICL_POS                          (0U)
#define INTC_NMICLR_NMICL                              (0x00000001UL)
#define INTC_NMICLR_XTALSTPCL_POS                      (1U)
#define INTC_NMICLR_XTALSTPCL                          (0x00000002UL)
#define INTC_NMICLR_SWDTCL_POS                         (2U)
#define INTC_NMICLR_SWDTCL                             (0x00000004UL)
#define INTC_NMICLR_PVDCL_POS                          (3U)
#define INTC_NMICLR_PVDCL                              (0x00000008UL)

