MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120F8TA/mcu.h
typedef struct {
    stc_i2c_cr1_bit_t                        CR1_b;
    stc_i2c_cr2_bit_t                        CR2_b;
    uint32_t                                 RESERVED0[32];
    stc_i2c_cr4_bit_t                        CR4_b;
    stc_i2c_slr0_bit_t                       SLR0_b;
    stc_i2c_slr1_bit_t                       SLR1_b;
    uint32_t                                 RESERVED1[32];
    stc_i2c_sr_bit_t                         SR_b;
    stc_i2c_clr_bit_t                        CLR_b;
    uint32_t                                 RESERVED2[96];
    stc_i2c_fltr_bit_t                       FLTR_b;
} bCM_I2C_TypeDef;

typedef struct {
    stc_icg_icg0_bit_t                       ICG0_b;
    stc_icg_icg1_bit_t                       ICG1_b;
} bCM_ICG_TypeDef;

typedef struct {
    stc_intc_nmicr_bit_t                     NMICR_b;
    stc_intc_nmienr_bit_t                    NMIENR_b;
    stc_intc_nmifr_bit_t                     NMIFR_b;
    stc_intc_nmiclr_bit_t                    NMICLR_b;
    uint32_t                                 RESERVED0[128];
    stc_intc_evter_bit_t                     EVTER_b;
    stc_intc_ekeycr_bit_t                    EKEYCR_b;
    uint32_t                                 RESERVED1[192];
    stc_intc_eirqcr_bit_t                    EIRQCR0_b;
    stc_intc_eirqcr_bit_t                    EIRQCR1_b;
    stc_intc_eirqcr_bit_t                    EIRQCR2_b;
    stc_intc_eirqcr_bit_t                    EIRQCR3_b;
    stc_intc_eirqcr_bit_t                    EIRQCR4_b;
    stc_intc_eirqcr_bit_t                    EIRQCR5_b;
    stc_intc_eirqcr_bit_t                    EIRQCR6_b;
    stc_intc_eirqcr_bit_t                    EIRQCR7_b;
    stc_intc_eirqcr_bit_t                    EIRQCR8_b;
    stc_intc_eirqcr_bit_t                    EIRQCR9_b;
    uint32_t                                 RESERVED2[64];
    stc_intc_wupen_bit_t                     WUPEN_b;
    stc_intc_eirqfr_bit_t                    EIRQFR_b;
    uint32_t                                 RESERVED3[832];
    stc_intc_iselbr_bit_t                    ISELBR24_b;
    stc_intc_iselbr_bit_t                    ISELBR25_b;
    stc_intc_iselbr_bit_t                    ISELBR26_b;
    stc_intc_iselbr_bit_t                    ISELBR27_b;
    stc_intc_iselbr_bit_t                    ISELBR28_b;
    stc_intc_iselbr_bit_t                    ISELBR29_b;
    stc_intc_iselbr_bit_t                    ISELBR30_b;
    stc_intc_iselbr_bit_t                    ISELBR31_b;
} bCM_INTC_TypeDef;

typedef struct {
    stc_pwc_stpmcr_bit_t                     STPMCR_b;
    uint32_t                                 RESERVED0[24];
    stc_pwc_pwrc_bit_t                       PWRC_b;
    uint32_t                                 RESERVED1[56];
    stc_pwc_ramcr_bit_t                      RAMCR_b;
    uint32_t                                 RESERVED2[24];
    stc_pwc_lvdcsr_bit_t                     LVDCSR_b;
    uint32_t                                 RESERVED3[120];
    stc_pwc_fprc_bit_t                       FPRC_b;
    uint32_t                                 RESERVED4[240];
    stc_pwc_dbgc_bit_t                       DBGC_b;
} bCM_PWC_TypeDef;

typedef struct {
    stc_rmu_rstf0_bit_t                      RSTF0_b;
} bCM_RMU_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_spi_cr1_bit_t                        CR1_b;
    uint32_t                                 RESERVED1[32];
    stc_spi_cfg1_bit_t                       CFG1_b;
    uint32_t                                 RESERVED2[32];
    stc_spi_sr_bit_t                         SR_b;
    stc_spi_cfg2_bit_t                       CFG2_b;
} bCM_SPI_TypeDef;

typedef struct {
    stc_swdt_cr_bit_t                        CR_b;
    stc_swdt_sr_bit_t                        SR_b;
} bCM_SWDT_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[128];
    stc_tmr0_bconr_bit_t                     BCONR_b;
    stc_tmr0_stflr_bit_t                     STFLR_b;
} bCM_TMR0_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[1024];
    stc_tmrb_bcstrl_bit_t                    BCSTRL_b;
    stc_tmrb_bcstrh_bit_t                    BCSTRH_b;
    uint32_t                                 RESERVED1[16];
    stc_tmrb_hconr_bit_t                     HCONR_b;
    uint32_t                                 RESERVED2[16];
    stc_tmrb_hcupr_bit_t                     HCUPR_b;
    uint32_t                                 RESERVED3[16];
    stc_tmrb_hcdor_bit_t                     HCDOR_b;
    uint32_t                                 RESERVED4[16];
    stc_tmrb_iconr_bit_t                     ICONR_b;
    uint32_t                                 RESERVED5[16];
    stc_tmrb_econr_bit_t                     ECONR_b;
    uint32_t                                 RESERVED6[48];
    stc_tmrb_stflr_bit_t                     STFLR_b;
    uint32_t                                 RESERVED7[784];
    stc_tmrb_cconr_bit_t                     CCONR_b;
    uint32_t                                 RESERVED8[496];
    stc_tmrb_pconr_bit_t                     PCONR_b;
} bCM_TMRB_TypeDef;

typedef struct {
    stc_usart_sr_bit_t                       SR_b;
    stc_usart_tdr_bit_t                      TDR_b;
    uint32_t                                 RESERVED0[48];
    stc_usart_cr1_bit_t                      CR1_b;
    stc_usart_cr2_bit_t                      CR2_b;
    stc_usart_cr3_bit_t                      CR3_b;
} bCM_USART_TypeDef;


/******************************************************************************/
/*      Device Specific Peripheral bit_band declaration & memory map          */
/******************************************************************************/
#define bCM_ADC                              ((bCM_ADC_TypeDef *)0x42170000UL)
#define bCM_AOS                              ((bCM_AOS_TypeDef *)0x42018000UL)
#define bCM_CMU                              ((bCM_CMU_TypeDef *)0x42288000UL)
#define bCM_CRC                              ((bCM_CRC_TypeDef *)0x422A8000UL)
#define bCM_CTC                              ((bCM_CTC_TypeDef *)0x42000000UL)
#define bCM_DBGC                             ((bCM_DBGC_TypeDef *)0x422A0000UL)
#define bCM_EFM                              ((bCM_EFM_TypeDef *)0x42010000UL)
#define bCM_GPIO                             ((bCM_GPIO_TypeDef *)0x42270000UL)
#define bCM_I2C                              ((bCM_I2C_TypeDef *)0x42090000UL)
#define bCM_INTC                             ((bCM_INTC_TypeDef *)0x42220000UL)
#define bCM_PWC                              ((bCM_PWC_TypeDef *)0x42280000UL)
#define bCM_RMU                              ((bCM_RMU_TypeDef *)0x42282000UL)
#define bCM_SPI                              ((bCM_SPI_TypeDef *)0x42070000UL)
#define bCM_SWDT                             ((bCM_SWDT_TypeDef *)0x42198000UL)
#define bCM_TMR0                             ((bCM_TMR0_TypeDef *)0x420B0000UL)
#define bCM_TMRB_1                           ((bCM_TMRB_TypeDef *)0x420F0000UL)
#define bCM_TMRB_2                           ((bCM_TMRB_TypeDef *)0x420F8000UL)
#define bCM_TMRB_3                           ((bCM_TMRB_TypeDef *)0x42100000UL)
#define bCM_TMRB_4                           ((bCM_TMRB_TypeDef *)0x42108000UL)
#define bCM_TMRB_5                           ((bCM_TMRB_TypeDef *)0x42110000UL)
#define bCM_TMRB_6                           ((bCM_TMRB_TypeDef *)0x42118000UL)
#define bCM_TMRB_7                           ((bCM_TMRB_TypeDef *)0x42120000UL)
#define bCM_TMRB_8                           ((bCM_TMRB_TypeDef *)0x42128000UL)
#define bCM_USART1                           ((bCM_USART_TypeDef *)0x42030000UL)
#define bCM_USART2                           ((bCM_USART_TypeDef *)0x42038000UL)
#define bCM_USART3                           ((bCM_USART_TypeDef *)0x42040000UL)
#define bCM_USART4                           ((bCM_USART_TypeDef *)0x42048000UL)


#ifdef __cplusplus
}
#endif

#endif /* __HC32F120F8TA_H__ */
